# # 1.计算1到100的累加和
# # i = 1
# # sum = 0
# # while i <= 100:
# #     sum += i
# #     i += 1
# #
# # print(sum)
#
# # 2.计算1~100之间的偶数累加和
#
# i = 1
# sum = 0
# while i<=100:
#     if i%2 == 0:
#         sum += i
#     i += 1
# print("1~100之间的偶数和是%d" %sum)

#案例3：实现计算1~100之间能够被3整除且能够被7整除的所有数之和


# sum = 0
# i = 1
#
# while i<=100:
#     if i%3==0 and i%7==0:
#         sum+=i
#     i += 1
# print("1~100之间能够被3整除且能够被7整除的所有数之和为%d" %sum )


#案例4

i = 1
while i<=5:
    print("%d--->%d" %(i,i**2))
    i += 1


